
{
  "Header": {
    "home": "Home",
    "browseProfiles": "Profiles",
    "searchProfiles": "Search Profiles",
    "search": "Search",
    "successStories": "Success Stories",
    "islamicGuidance": "Islamic Guidance",
    "login": "Login",
    "language": "Language",
    "aboutUs": "About Us",
    "help": "Help"
  },
  "HomePage": {
    "heroTitle": "Find Your Life Partner - The Islamic Way",
    "heroSubtitle": "A FREE platform for the Muslim community of Madhubani. With a focus on privacy and Islamic values.",
    "createProfile": "Create Profile",
    "browseProfiles": "Search Profiles",
    "newProfiles": "Newly Listed Profiles",
    "newProfilesSubtitle": "Get a glimpse of the latest members to join our community.",
    "seeAllProfiles": "See All Profiles",
    "videoGuidanceTitle": "Marriage Guidance Videos",
    "videoGuidanceSubtitle": "Watch these short videos for valuable Islamic insights on marriage.",
    "stat1_title": "500+ Successful Nikahs",
    "stat1_subtitle": "In the Madhubani region.",
    "stat2_title": "100% Free Service",
    "stat2_subtitle": "No hidden fees, ever.",
    "stat3_title": "Total Privacy Protection",
    "stat3_subtitle": "Your data is safe with us.",
    "footer_tagline": "Halal Connections, Trusted Platform",
    "footer_subtitle": "Trusted Islamic Matrimony for Madhubani"
  },
  "Buttons": {
    "createAccount": "Create Account",
    "login": "Login"
  },
  "AppTour": {
    "step1_title": "Welcome!",
    "step1_content": "Welcome to Madhubani Nikah! Let's take a quick tour of the platform.",
    "step2_title": "Create Your Profile",
    "step2_content": "Click here to create your free profile and start your search for a life partner.",
    "step3_title": "Browse Profiles",
    "step3_content": "Or, you can start by browsing profiles from our community right away.",
    "step4_title": "Discover Nearby Profiles",
    "step4_content": "Get a glimpse of profiles from your local area right here on the homepage.",
    "step5_title": "Switch Language",
    "step5_content": "You can switch the language between English, Hindi, and Urdu to use the site comfortably."
  },
  "Quotes": {
    "title": "Today's Inspiring Verse",
    "quran1": "And among His signs is this: that He created for you mates from among yourselves, that you may dwell in tranquility with them, and He has put love and mercy between your hearts.",
    "quran2": "And marry the unmarried among you and the righteous among your male slaves and female slaves.",
    "hadith1": "When a person marries, he has fulfilled half of his religion.",
    "hadith2": "O young people! Those among you who can support a wife should marry, for it helps him lower his gaze and guard his modesty.",
    "hadith3": "Marriage is part of my Sunnah. Whoever does not follow my Sunnah has nothing to do with me.",
    "wisdom1": "Nikah is not just a contract; it is a sacred bond founded on love, respect, and commitment in Islam."
  },
  "NikahSimplified": {
    "mainTitle": "Nikah, Simplified and Blessed",
    "mainSubtitle": "Our platform is built on Islamic principles to make finding a righteous partner easier for both families and individuals.",
    "parents_title": "A Message to Respected Parents",
    "parents_subtitle": "Fulfilling your sacred duty with ease and trust.",
    "parents_para1": "Easing the path to Nikah for your children is one of the greatest responsibilities and rewards. Our platform helps you find suitable, verified matches from our community while respecting our traditions. Avoid unnecessary delays and societal pressures.",
    "parents_para2": "Involve yourself in a blessed process, where character and piety are valued above all. With our help, you can connect with families who share your values.",
    "youth_title": "Guidance for Our Youth",
    "youth_subtitle": "Start your journey with the right intentions.",
    "youth_step1_title": "Focus on Deen & Character",
    "youth_step1_desc": "Look for a partner whose faith and character will help you grow closer to Allah.",
    "youth_step2_title": "Be Honest & Clear",
    "youth_step2_desc": "Create a sincere profile. Honesty is the foundation of a blessed union.",
    "youth_step3_title": "Involve Your Family",
    "youth_step3_desc": "Seek the guidance and blessings of your elders. Our platform facilitates family involvement."
  },
  "Donation": {
    "title": "Support Our Mission",
    "subtitle": "Help us keep this platform free for everyone.",
    "description": "Madhubani Nikah is a 100% free community service. We rely on the generous support of our users to cover server costs, maintenance, and future development. Your contribution, no matter how small, helps us facilitate blessed unions.",
    "button": "Donate Now"
  }
}
