
{
  "Header": {
    "home": "होम",
    "browseProfiles": "प्रोफ़ाइल",
    "search": "खोजें",
    "successStories": "सफलता की कहानियाँ",
    "islamicGuidance": "इस्लामी मार्गदर्शन",
    "login": "लॉग इन करें",
    "language": "भाषा"
  },
  "HomePage": {
    "heroTitle": "अपना जीवन साथी खोजें - इस्लामी तरीके से",
    "heroSubtitle": "मधुबनी के मुस्लिम समुदाय के लिए एक मुफ़्त मंच। गोपनीयता और इस्लामी मूल्यों पर ध्यान देने के साथ।",
    "createProfile": "प्रोफ़ाइल बनाएं",
    "browseProfiles": "प्रोफ़ाइल ब्राउज़ करें",
    "newProfiles": "नए सूचीबद्ध प्रोफ़ाइल",
    "newProfilesSubtitle": "हमारे समुदाय में शामिल होने वाले नवीनतम सदस्यों की एक झलक पाएं।",
    "seeAllProfiles": "सभी प्रोफ़ाइल देखें",
    "stat1_title": "500+ सफल निकाह",
    "stat1_subtitle": "मधुबनी क्षेत्र में।",
    "stat2_title": "100% मुफ्त सेवा",
    "stat2_subtitle": "कोई छिपा हुआ शुल्क नहीं।",
    "stat3_title": "पूर्ण गोपनीयता सुरक्षा",
    "stat3_subtitle": "आपका डेटा हमारे पास सुरक्षित है।",
    "footer_tagline": "हलाल रिश्ते, भरोसेमंद प्लेटफॉर्म",
    "footer_subtitle": "मधुबनी के लिए विश्वसनीय इस्लामी मैट्रिमोनी"
  },
  "Buttons": {
    "createAccount": "नया अकाउंट बनाएं",
    "login": "लॉग इन करें"
  },
  "AppTour": {
    "step1_title": "आपका स्वागत है!",
    "step1_content": "मधुबनी निकाह में आपका स्वागत है! आइए इस प्लेटफॉर्म का एक त्वरित दौरा करें।",
    "step2_title": " अपनी प्रोफ़ाइल बनाएं",
    "step2_content": "अपना मुफ़्त प्रोफ़ाइल बनाने और जीवन साथी की तलाश शुरू करने के लिए यहां क्लिक करें।",
    "step3_title": "प्रोफ़ाइल ब्राउज़ करें",
    "step3_content": "या, आप तुरंत हमारे समुदाय के प्रोफ़ाइल ब्राउज़ करके शुरू कर सकते हैं।",
    "step4_title": "आस-पास के प्रोफ़ाइल खोजें",
    "step4_content": "होमपेज पर ही अपने स्थानीय क्षेत्र के प्रोफ़ाइल की एक झलक पाएं।",
    "step5_title": "भाषा बदलें",
    "step5_content": "साइट को आराम से उपयोग करने के लिए आप अंग्रेजी, हिंदी और उर्दू के बीच भाषा बदल सकते हैं।"
  },
  "Quotes": {
    "title": "आज की प्रेरणादायक आयत",
    "quote1": "और उसकी निशानियों में से है कि उसने तुम्हारे लिए तुम्हारी ही جنس से जोड़े बनाए ताकि तुम उनके पास सुकून हासिल करो और तुम्हारे बीच मुहब्बत और रहमत पैदा कर दी।",
    "quote2": "ईमान वालों में सबसे कामिल ईमान वाला वो है जिसके अख़लाक़ सबसे अच्छे हों; और तुम में सबसे बेहतर वो हैं जो अपनी बीवियों के लिए सबसे बेहतर हों।",
    "quote3": "एक बेहतरीन शादी तब नहीं होती जब एक 'आदर्श जोड़ा' एक साथ आता है। यह तब होती है जब एक साधारण जोड़ा अपने मतभेदों का आनंद लेना सीखता है।",
    "quote4": "जब कोई व्यक्ति शादी करता है, तो उसने अपने दीन का आधा हिस्सा पूरा कर लिया है।",
    "quote5": "और तुममें से जो लोग अविवाहित हों, उनका निकाह कर दो।"
  },
  "NikahSimplified": {
    "mainTitle": "निकाह, सरल और بابرکت",
    "mainSubtitle": "हमारा मंच इस्लामी सिद्धांतों पर बनाया गया है ताकि परिवारों और व्यक्तियों दोनों के लिए एक नेक साथी ढूंढना आसान हो सके।",
    "parents_title": "सम्मानित माता-पिता के लिए एक संदेश",
    "parents_subtitle": "अपने पवित्र कर्तव्य को आसानी और विश्वास के साथ पूरा करें।",
    "parents_para1": "अपने बच्चों के लिए निकाह का रास्ता आसान बनाना सबसे बड़ी जिम्मेदारियों और इनामों में से एक है। हमारा मंच आपको हमारी परंपराओं का सम्मान करते हुए हमारे समुदाय से उपयुक्त, सत्यापित रिश्ते ढूंढने में मदद करता है। अनावश्यक देरी और सामाजिक दबावों से बचें।",
    "parents_para2": "एक بابرکت प्रक्रिया में खुद को शामिल करें, जहां चरित्र और تقویٰ کو سب سے بڑھ کر اہمیت دی جاتی ہے۔ हमारी مدد से, आप ان خاندانوں سے رابطہ کر سکتے ہیں جو آپ کی اقدار کا اشتراک کرتے ہیں۔",
    "youth_title": "हमारे युवाओं के लिए मार्गदर्शन",
    "youth_subtitle": "सही इरादों के साथ अपना सफर शुरू करें।",
    "youth_step1_title": "दीन और चरित्र पर ध्यान दें",
    "youth_step1_desc": "एक ऐसा साथी चुनें जिसका ईमान और किरदार आपको अल्लाह के करीब लाने में मदद करे।",
    "youth_step2_title": "ईमानदार और स्पष्ट रहें",
    "youth_step2_desc": "एक सच्ची प्रोफ़ाइल बनाएं। ईमानदारी एक بابرکت رشتے کی بنیاد ہے۔",
    "youth_step3_title": "अपने परिवार को शामिल करें",
    "youth_step3_desc": "अपने बड़ों का मार्गदर्शन और दुआएं लें। हमारा मंच पारिवारिक भागीदारी को सुविधाजनक बनाता है।"
  },
  "Donation": {
    "title": "हमारे मिशन का समर्थन करें",
    "subtitle": "इस प्लेटफॉर्म को सभी के लिए मुफ्त रखने में हमारी मदद करें।",
    "description": "मधुबनी निकाह एक 100% मुफ्त सामुदायिक सेवा है। हम सर्वर लागत, रखरखाव और भविष्य के विकास को कवर करने के लिए अपने उपयोगकर्ताओं के उदार समर्थन पर भरोसा करते हैं। आपका योगदान, चाहे कितना भी छोटा क्यों न हो, हमें بابرکت نکاح کو آسان بنانے میں مدد کرتا ہے۔",
    "button": "अभी दान करें"
  }
}
