
{
  "Header": {
    "home": "پہلا صفحہ",
    "browseProfiles": "پروفائل دیکھیں",
    "search": "تلاش کریں",
    "successStories": "کامیابی کی کہانیاں",
    "islamicGuidance": "اسلامی رہنمائی",
    "aboutUs": "ہمارے بارے میں",
    "help": "مدد",
    "login": "لاگ ان کریں",
    "language": "زبان"
  },
  "HomePage": {
    "heroTitle": "اپنا جیون ساتھی تلاش کریں - اسلامی طریقے سے",
    "heroSubtitle": "مدھوبنی کی مسلم برادری کے لیے ایک مفت پلیٹ فارم۔ رازداری اور اسلامی اقدار پر توجہ کے ساتھ۔",
    "createProfile": "پروفائل بنائیں",
    "browseProfiles": "پروفائل براؤز کریں",
    "nearbyProfiles": "قریبی پروفائلز",
    "nearbyProfilesSubtitle": "اپنے علاقے کے پروفائلز کی ایک جھلک حاصل کریں۔",
    "seeAllProfiles": "تمام پروفائلز دیکھنے کے لیے رجسٹر کریں۔",
    "stat1_title": "500+ کامیاب نکاح",
    "stat1_subtitle": "مدھوبنی کے علاقے میں۔",
    "stat2_title": "100% مفت سروس",
    "stat2_subtitle": "کوئی پوشیدہ فیس نہیں، کبھی نہیں۔",
    "stat3_title": "مکمل رازداری کا تحفظ",
    "stat3_subtitle": "آپ کا ڈیٹا ہمارے پاس محفوظ ہے۔",
    "footer_tagline": "حلال رشتے، بھروسمند پلیٹ فارم",
    "footer_subtitle": "مدھوبنی کے لیے قابل اعتماد اسلامی شادی"
  },
  "Buttons": {
    "createAccount": "نیا اکاؤنٹ بنائیں",
    "login": "لاگ ان کریں"
  },
  "AppTour": {
    "step1_title": "خوش آمدید!",
    "step1_content": "مدھوبنی نکاح میں خوش آمدید! آئیے پلیٹ فارم کا ایک فوری دورہ کریں۔",
    "step2_title": "اپنی پروفائل بنائیں",
    "step2_content": "اپنی مفت پروفائل بنانے اور جیون ساتھی کی تلاش شروع کرنے کے لیے یہاں کلک کریں۔",
    "step3_title": "پروفائلز براؤز کریں",
    "step3_content": "یا، آپ فوراً ہماری کمیونٹی سے پروفائلز براؤز کرنا شروع کر سکتے ہیں۔",
    "step4_title": "قریبی پروفائلز دریافت کریں",
    "step4_content": "یہیں ہوم پیج پر اپنے مقامی علاقے کے پروفائلز کی ایک جھلک دیکھیں۔",
    "step5_title": "زبان تبدیل کریں",
    "step5_content": "سائٹ کو آرام سے استعمال کرنے کے لیے آپ انگریزی، ہندی اور اردو کے درمیان زبان تبدیل کر سکتے ہیں۔"
  },
  "Quotes": {
    "title": "آج کی متاثر کن آیت",
    "quote1": "اور اُس کی نشانیوں میں سے ہے کہ اُس نے تمہارے لیے تمہی میں سے جوڑے بنائے تاکہ تم اُن سے سکون حاصل کرو، اور اُس نے تمہارے درمیان محبت اور رحمت پیدا کی۔",
    "quote2": "مومنوں میں سب سے کامل ایمان والا وہ ہے جس کا اخلاق سب سے اچھا ہو؛ اور تم میں سب سے بہتر وہ ہیں جو اپنی بیویوں کے لیے سب سے بہتر ہوں۔",
    "quote3": "ایک عظیم شادی تب نہیں ہوتی جب 'کامل جوڑا' اکٹھا ہوتا ہے۔ یہ تب ہوتی ہے جب ایک نامکمل جوڑا اپنے اختلافات سے لطف اندوز ہونا سیکھتا ہے۔",
    "quote4": "جب کوئی شخص شادی کرتا ہے تو اس نے اپنے دین کا نصف حصہ مکمل کر لیا۔",
    "quote5": "اور تم میں سے جو لوگ غیر شادی شدہ ہوں، اُن کا نکاح کر دو۔"
  },
  "NikahSimplified": {
    "mainTitle": "نکاح، آسان اور بابرکت",
    "mainSubtitle": "ہمارا پلیٹ فارم اسلامی اصولوں پر بنایا گیا ہے تاکہ خاندانوں اور افراد دونوں کے لیے ایک نیک ساتھی تلاش کرنا آسان ہو سکے۔",
    "parents_title": "معزز والدین کے نام ایک پیغام",
    "parents_subtitle": "اپنے مقدس فرض کو آسانی اور اعتماد کے ساتھ پورا کریں۔",
    "parents_para1": "اپنے بچوں کے لیے نکاح کی راہ ہموار کرنا سب سے بڑی ذمہ داریوں اور انعامات میں سے ایک ہے۔ ہمارا پلیٹ فارم آپ کو ہماری روایات کا احترام کرتے ہوئے ہماری کمیونٹی سے موزوں، تصدیق شدہ رشتے تلاش کرنے میں مدد کرتا ہے۔ غیر ضروری تاخیر اور سماجی دباؤ سے بچیں۔",
    "parents_para2": "ایک بابرکت عمل میں خود کو شامل کریں، جہاں کردار اور تقویٰ کو سب سے بڑھ کر اہمیت دی جاتی ہے۔ ہماری مدد سے، آپ ان خاندانوں سے رابطہ کر سکتے ہیں جو آپ کی اقدار کا اشتراک کرتے ہیں۔",
    "youth_title": "ہمارے نوجوانوں کے لیے رہنمائی",
    "youth_subtitle": "اپنے سفر کا آغاز صحیح نیتوں سے کریں۔",
    "youth_step1_title": "دین اور کردار پر توجہ دیں",
    "youth_step1_desc": "ایسا ساتھی تلاش کریں جس کا ایمان اور کردار آپ کو اللہ کے قریب ہونے میں مدد دے۔",
    "youth_step2_title": "ایماندار اور واضح رہیں",
    "youth_step2_desc": "ایک مخلص پروفائل بنائیں۔ ایمانداری ایک بابرکت رشتے کی بنیاد ہے۔",
    "youth_step3_title": "اپنے خاندان کو شامل کریں",
    "youth_step3_desc": "اپنے بزرگوں سے رہنمائی اور دعائیں لیں۔ ہمارا پلیٹ فارم خاندانی شرکت کو آسان بناتا ہے۔"
  }
}
